adafruit/seesaw/lib/samd21/samd21d/atdf/ATSAMD21J17D.atdf
        <module name="PTC" id="U2215" version="1.0.4">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="X" index="0" function="B" pad="PA08"/>
              <signal group="X" index="1" function="B" pad="PA09"/>
              <signal group="X" index="2" function="B" pad="PA10"/>
              <signal group="X" index="3" function="B" pad="PA11"/>
              <signal group="X" index="4" function="B" pad="PA16"/>
              <signal group="X" index="5" function="B" pad="PA17"/>
              <signal group="X" index="6" function="B" pad="PA18"/>
              <signal group="X" index="7" function="B" pad="PA19"/>
              <signal group="X" index="8" function="B" pad="PA20"/>
              <signal group="X" index="9" function="B" pad="PA21"/>
              <signal group="X" index="10" function="B" pad="PA22"/>
              <signal group="X" index="11" function="B" pad="PA23"/>
              <signal group="X" index="12" function="B" pad="PB12"/>
              <signal group="X" index="13" function="B" pad="PB13"/>
              <signal group="X" index="14" function="B" pad="PB14"/>
              <signal group="X" index="15" function="B" pad="PB15"/>
              <signal group="Y" index="0" function="B" pad="PA02"/>
              <signal group="Y" index="1" function="B" pad="PA03"/>
              <signal group="Y" index="2" function="B" pad="PA04"/>
              <signal group="Y" index="3" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA07"/>
              <signal group="Y" index="6" function="B" pad="PB00"/>
              <signal group="Y" index="7" function="B" pad="PB01"/>
              <signal group="Y" index="8" function="B" pad="PB02"/>
              <signal group="Y" index="9" function="B" pad="PB03"/>
              <signal group="Y" index="10" function="B" pad="PB04"/>
              <signal group="Y" index="11" function="B" pad="PB05"/>
              <signal group="Y" index="12" function="B" pad="PB06"/>
              <signal group="Y" index="13" function="B" pad="PB07"/>
              <signal group="Y" index="14" function="B" pad="PB08"/>
              <signal group="Y" index="15" function="B" pad="PB09"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="34" caption="Index of Generic Clock"/>
              <param name="INSTANCE_ID" value="83"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1" caption="Number of Alarms"/>
              <param name="COMP16_NUM" value="2" caption="Number of 16-bit Comparators"/>
              <param name="COMP32_NUM" value="1" caption="Number of 32-bit Comparators"/>
              <param name="GCLK_ID" value="4" caption="Index of Generic Clock"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms (obsolete)"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators (obsolete)"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators (obsolete)"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.2.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="2" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="20" caption="Index of Generic Clock for Core"/>
              <param name="GCLK_ID_SLOW" value="19" caption="Index of Generic Clock for SMbus timeout"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="4" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="21" caption="Index of Generic Clock for Core"/>
              <param name="GCLK_ID_SLOW" value="19" caption="Index of Generic Clock for SMbus timeout"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
